Revit 2027 API
ParameterTypeId.RoofCurveIsSlopeDefining Property
 "Defines Roof Slope"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofCurveIsSlopeDefining { get; }
Public Shared ReadOnly Property RoofCurveIsSlopeDefining As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofCurveIsSlopeDefining {
	ForgeTypeId^ get ();
}
static member RoofCurveIsSlopeDefining : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace